----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
   ReflectionPad2d-1            [-1, 1, 54, 54]               0
            Conv2d-2           [-1, 64, 48, 48]           3,136
       BatchNorm2d-3           [-1, 64, 48, 48]             128
              ReLU-4           [-1, 64, 48, 48]               0
            Conv2d-5          [-1, 128, 24, 24]          73,728
       BatchNorm2d-6          [-1, 128, 24, 24]             256
              ReLU-7          [-1, 128, 24, 24]               0
            Conv2d-8          [-1, 256, 12, 12]         294,912
       BatchNorm2d-9          [-1, 256, 12, 12]             512
             ReLU-10          [-1, 256, 12, 12]               0
  ReflectionPad2d-11          [-1, 256, 14, 14]               0
           Conv2d-12          [-1, 256, 12, 12]         589,824
      BatchNorm2d-13          [-1, 256, 12, 12]             512
             ReLU-14          [-1, 256, 12, 12]               0
          Dropout-15          [-1, 256, 12, 12]               0
  ReflectionPad2d-16          [-1, 256, 14, 14]               0
           Conv2d-17          [-1, 256, 12, 12]         589,824
      BatchNorm2d-18          [-1, 256, 12, 12]             512
      ResnetBlock-19          [-1, 256, 12, 12]               0
  ReflectionPad2d-20          [-1, 256, 14, 14]               0
           Conv2d-21          [-1, 256, 12, 12]         589,824
      BatchNorm2d-22          [-1, 256, 12, 12]             512
             ReLU-23          [-1, 256, 12, 12]               0
          Dropout-24          [-1, 256, 12, 12]               0
  ReflectionPad2d-25          [-1, 256, 14, 14]               0
           Conv2d-26          [-1, 256, 12, 12]         589,824
      BatchNorm2d-27          [-1, 256, 12, 12]             512
      ResnetBlock-28          [-1, 256, 12, 12]               0
  ReflectionPad2d-29          [-1, 256, 14, 14]               0
           Conv2d-30          [-1, 256, 12, 12]         589,824
      BatchNorm2d-31          [-1, 256, 12, 12]             512
             ReLU-32          [-1, 256, 12, 12]               0
          Dropout-33          [-1, 256, 12, 12]               0
  ReflectionPad2d-34          [-1, 256, 14, 14]               0
           Conv2d-35          [-1, 256, 12, 12]         589,824
      BatchNorm2d-36          [-1, 256, 12, 12]             512
      ResnetBlock-37          [-1, 256, 12, 12]               0
  ReflectionPad2d-38          [-1, 256, 14, 14]               0
           Conv2d-39          [-1, 256, 12, 12]         589,824
      BatchNorm2d-40          [-1, 256, 12, 12]             512
             ReLU-41          [-1, 256, 12, 12]               0
          Dropout-42          [-1, 256, 12, 12]               0
  ReflectionPad2d-43          [-1, 256, 14, 14]               0
           Conv2d-44          [-1, 256, 12, 12]         589,824
      BatchNorm2d-45          [-1, 256, 12, 12]             512
      ResnetBlock-46          [-1, 256, 12, 12]               0
  ConvTranspose2d-47          [-1, 128, 24, 24]         294,912
      BatchNorm2d-48          [-1, 128, 24, 24]             256
             ReLU-49          [-1, 128, 24, 24]               0
  ConvTranspose2d-50           [-1, 64, 48, 48]          73,728
      BatchNorm2d-51           [-1, 64, 48, 48]             128
             ReLU-52           [-1, 64, 48, 48]               0
  ReflectionPad2d-53           [-1, 64, 54, 54]               0
           Conv2d-54            [-1, 1, 48, 48]           3,137
             Tanh-55            [-1, 1, 48, 48]               0
================================================================
Total params: 5,467,521
Trainable params: 5,467,521
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 23.39
Params size (MB): 20.86
Estimated Total Size (MB): 44.25
----------------------------------------------------------------
None
----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1           [-1, 64, 24, 24]           1,088
         LeakyReLU-2           [-1, 64, 24, 24]               0
            Conv2d-3          [-1, 128, 12, 12]         131,072
       BatchNorm2d-4          [-1, 128, 12, 12]             256
         LeakyReLU-5          [-1, 128, 12, 12]               0
            Conv2d-6            [-1, 256, 6, 6]         524,288
       BatchNorm2d-7            [-1, 256, 6, 6]             512
         LeakyReLU-8            [-1, 256, 6, 6]               0
            Conv2d-9            [-1, 512, 5, 5]       2,097,152
      BatchNorm2d-10            [-1, 512, 5, 5]           1,024
        LeakyReLU-11            [-1, 512, 5, 5]               0
           Conv2d-12              [-1, 1, 4, 4]           8,193
          Sigmoid-13              [-1, 1, 4, 4]               0
================================================================
Total params: 2,763,585
Trainable params: 2,763,585
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 0.01
Forward/backward pass size (MB): 1.49
Params size (MB): 10.54
Estimated Total Size (MB): 12.04
----------------------------------------------------------------
None
